resources/notification.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b190328.0053 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b190328.0053 svn-revision#unknown. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
             xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://eu.europa.ec.dgt.epoetry"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://eu.europa.ec.dgt.epoetry" name="DgtClientNotificationReceiverWS">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://eu.europa.ec.dgt.epoetry"
                        schemaLocation="notification.xsd"/>
        </xsd:schema>
    </types>
    <message name="receiveNotification">
        <part name="parameters" element="tns:receiveNotification"/>
    </message>
    <message name="receiveNotificationResponse">
        <part name="parameters" element="tns:receiveNotificationResponse"/>
    </message>
    <portType name="DgtClientNotificationReceiverWS">
        <operation name="receiveNotification">
            <input wsam:Action="http://eu.europa.ec.dgt.epoetry/DgtClientNotificationReceiverWS/receiveNotificationRequest"
                   message="tns:receiveNotification"/>
            <output wsam:Action="http://eu.europa.ec.dgt.epoetry/DgtClientNotificationReceiverWS/receiveNotificationResponse"
                    message="tns:receiveNotificationResponse"/>
        </operation>
    </portType>
    <binding name="DgtClientNotificationReceiverWSPortBinding" type="tns:DgtClientNotificationReceiverWS">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="receiveNotification">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="DgtClientNotificationReceiverWS">
        <port name="DgtClientNotificationReceiverWSPort" binding="tns:DgtClientNotificationReceiverWSPortBinding">
            <soap:address
                    location="http://wlstd00470.cc.cec.eu.int:1042/epoetry/webservices/DgtClientNotificationReceiverWS"/>
        </port>
    </service>
</definitions>